Reports/фин_ДиаграммаГантаБюджетногоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>фин_ДиаграммаГантаБюджетногоПроцесса</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БюджетныйРегламент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.фин_БюджетныйРегламент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарныйПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.фин_КалендарныйПланБюджетнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДетализации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_УровеньДетализацииБюджетовПоПроектамИПодразделениям</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВариантыДиаграммыБюджетногоПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ВидыЗадачПоБюджетам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бюджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_МероприятияБюджетногоПроцесса</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапБюджетногоПроцесса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ЭтапыБюджетногоПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ранг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньДетализации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_УровеньДетализацииБюджетовПоПроектамИПодразделениям</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершенияФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КалендарныйПлан</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.фин_Бюджет</v8:Type>
								<v8:Type>cfg:DocumentRef.фин_РассмотрениеОтклоненийФактическихДанных</v8:Type>
								<v8:Type>cfg:DocumentRef.фин_КалендарныйПланБюджетнойКампании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Детализация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДетализации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньДетализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапБюджетногоПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КалендарныйПлан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ВариантыДиаграммыБюджетногоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВариантыДиаграммыБюджетногоПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСОтметкамиИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеисполненныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированноеИсполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/фин_ОтчетОбИсполненииЗадачиБюджетногоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>фин_ОтчетОбИсполненииЗадачиБюджетногоПроцесса</Name>
			<BasedOn>
				<xr:Item>Document.фин_Бюджет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.фин_КалендарныеПланыБюджетныхКампаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарныйПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.фин_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.фин_РассмотрениеОтклоненийФактическихДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.фин_КалендарныйПланБюджетнойКампании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыЗадачПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_МероприятияБюджетногоПроцесса</v8:Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапБюджетногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ЭтапыБюджетногоПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДетализации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_УровеньДетализацииБюджетовПоПроектамИПодразделениям</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ОтветственныеБюджетногоПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.фин_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.фин_РассмотрениеОтклоненийФактическихДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/фин_ДиаграммаГантаБюджетногоПроцесса/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Организация",Отчет.Организация);
	Параметры.Свойство("СценарийПланирования",Отчет.СценарийПланирования);
	Параметры.Свойство("БюджетныйРегламент",Отчет.БюджетныйРегламент);
	Параметры.Свойство("КалендарныйПлан",Отчет.КалендарныйПлан);
	Параметры.Свойство("Пользователь",Отчет.Пользователь);
	Параметры.Свойство("УровеньДетализации",Отчет.УровеньДетализации);
	Если Параметры.Свойство("Адрес") Тогда
		ДанныеХранилища = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		Отчет.ГрафикПроцесса.Загрузить(ДанныеХранилища.ГрафикПроцесса);	
		Отчет.Детализация.Загрузить(ДанныеХранилища.Детализация);
	Иначе
		Если НЕ ЗначениеЗаполнено(Отчет.Пользователь) Тогда
			Отчет.Пользователь = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ТекущийПользователь");
		КонецЕсли;
		Если Отчет.Детализация.Количество()=0 Тогда
			НоваяСтрока = Отчет.Детализация.Добавить();
			НоваяСтрока.ВидДетализации = Перечисления.фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса.Бюджет;
			НоваяСтрока = Отчет.Детализация.Добавить();
			НоваяСтрока.ВидДетализации = Перечисления.фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса.ВидЗадачи;
			Если фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("БюджетированиеПоОрганизациям") Тогда
				НоваяСтрока = Отчет.Детализация.Добавить();
				НоваяСтрока.ВидДетализации = Перечисления.фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса.Организация;
			КонецЕсли;
			Если фин_ОбщегоНазначенияВызовСервераПовтИсп.КоличествоСценариев()>1 Тогда
				НоваяСтрока = Отчет.Детализация.Добавить();
				НоваяСтрока.ВидДетализации = Перечисления.фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса.Сценарий;
			КонецЕсли;
			НоваяСтрока = Отчет.Детализация.Добавить();
			НоваяСтрока.ВидДетализации = Перечисления.фин_ВидыДетализацииДиаграммыГантаБюджетногоПроцесса.КалендарныйПлан;
		КонецЕсли;
		Отчет.Вариант = Перечисления.фин_ВариантыДиаграммыБюджетногоПроцесса.НеисполненныеЗадачи;
	КонецЕсли;
	Элементы.ВидШкалыВремени.СписокВыбора.Добавить(ТипЕдиницыШкалыВремени.День);
	Элементы.ВидШкалыВремени.СписокВыбора.Добавить(ТипЕдиницыШкалыВремени.Неделя);
	Элементы.ВидШкалыВремени.СписокВыбора.Добавить(ТипЕдиницыШкалыВремени.Месяц);
	Элементы.ВидШкалыВремени.СписокВыбора.Добавить(ТипЕдиницыШкалыВремени.Квартал);
	Элементы.ВидШкалыВремени.СписокВыбора.Добавить(ТипЕдиницыШкалыВремени.Год);
	ВидШкалыВремени = ТипЕдиницыШкалыВремени.День;
	Элементы.Масштаб.СписокВыбора.Добавить(ПоддержкаМасштабаДиаграммыГанта.Авто);
	Элементы.Масштаб.СписокВыбора.Добавить(ПоддержкаМасштабаДиаграммыГанта.ВсеДанные);
	Элементы.Масштаб.СписокВыбора.Добавить(ПоддержкаМасштабаДиаграммыГанта.Период);
	Элементы.Масштаб.СписокВыбора.Добавить(ПоддержкаМасштабаДиаграммыГанта.Фиксированная);
	Масштаб = ПоддержкаМасштабаДиаграммыГанта.Период;
	Если Параметры.ИзОбъекта Тогда
		Элементы.БюджетныйРегламент.ТолькоПросмотр = Истина;
		Элементы.КалендарныйПлан.ТолькоПросмотр = Истина;
		Элементы.ГруппаПериод.ТолькоПросмотр = Истина;
	   СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Отчеты.фин_ДиаграммаГантаБюджетногоПроцесса.СформироватьДиаграмму(Отчет,Диаграмма,ВидШкалыВремени,НЕ Параметры.ИзОбъекта,НЕ Параметры.ИзОбъекта);
	Если ЗначениеЗаполнено(Масштаб) Тогда
		Диаграмма.ПоддержкаМасштаба = Масштаб;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	Если ТипЗнч(Значения)=Тип("Массив") Тогда
		Для Каждого Расшифровка Из Значения Цикл
			Если ТипЗнч(Расшифровка.Расшифровка)=Тип("Структура") Тогда
				СтандартнаяОбработка = Ложь;
				СписокДействий = Новый СписокЗначений;
				СписокДействий.Добавить("ОткрытьЗначение","Открыть значение");
				СписокДействий.Добавить("РегистрацияИсполнения","Регистрация исполнения");
				ОписаниеОповещенияВыбораДействия = Новый ОписаниеОповещения("ОбработкаВыбораДействия",ЭтотОбъект,Расшифровка.Расшифровка);
				ПоказатьВыборИзМеню(ОписаниеОповещенияВыбораДействия,СписокДействий,Элементы.Диаграмма);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбораДействия(Результат,ДополнительныеПараметры) Экспорт
	Если Результат=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Значение = "ОткрытьЗначение" Тогда
		Попытка
			ПоказатьЗначение(,ДополнительныеПараметры.ДанныеРасшифровки);
		Исключение
		КонецПопытки;
	ИначеЕсли Результат.Значение = "РегистрацияИсполнения" Тогда
		мСтруктура = Новый ФиксированнаяСтруктура(ДополнительныеПараметры.СтруктураРасшифровки);
		СтруктураЗаполнения = Новый Структура(мСтруктура);
		Если ЗначениеЗаполнено(Отчет.КалендарныйПлан) Тогда
			СтруктураЗаполнения.Вставить("КалендарныйПлан",Отчет.КалендарныйПлан);
		КонецЕсли;
		Если НЕ СтруктураЗаполнения.Свойство("Организация") Тогда
			СтруктураЗаполнения.Вставить("Организация",Отчет.Организация);
		КонецЕсли;
		Если НЕ СтруктураЗаполнения.Свойство("Сценарий") Тогда
			СтруктураЗаполнения.Вставить("Сценарий",Отчет.СценарийПланирования);
		КонецЕсли;
		СтруктураЗаполнения.Вставить("Пользователь",фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ТекущийПользователь"));
		ОткрытьФорму("Документ.фин_ОтчетОбИсполненииЗадачиБюджетногоПроцесса.ФормаОбъекта",Новый Структура("Основание",СтруктураЗаполнения),ЭтотОбъект,Новый УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Масштаб) Тогда
		Диаграмма.ПоддержкаМасштаба = Масштаб;
	КонецЕсли;
КонецПроцедуры
